WMSGIFT/src/Documents/итWMSДанныеИнвентаризации/итWMSДанныеИнвентаризации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итWMSДанныеИнвентаризации</name>
  <registerRecords>AccumulationRegister.итТоварыВЯчейках</registerRecords>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.итWMSСтатусыСкладскихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>итОснование</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.итWMSЗадачиИнвентаризации</types>
      <types>DocumentRef.итWMSПриемка</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ДатаИнвентаризации</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.итСкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

WMSGIFT/src/Documents/итWMSРазмещение/итWMSРазмещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итWMSРазмещение</name>
  <basedOn>Document.итWMSПриемка</basedOn>
  <registerRecords>AccumulationRegister.итТоварыВЯчейках</registerRecords>
  <attributes>
    <name>итОснование</name>
    <type>
      <types>DocumentRef.итWMSПриемка</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.итWMSСтатусыСкладскихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СнимокТабличнойЧастиДоРаспределения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРаспределятьНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтратегияРазмещения</name>
    <type>
      <types>CatalogRef.итWMSСтратегии</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкладскоеПомещениеРазмещения</name>
    <type>
      <types>CatalogRef.итСкладскиеПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыСтратегии</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресХраненияПараметров</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаОтправитель</name>
      <type>
        <types>CatalogRef.итСкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаПолучатель</name>
      <type>
        <types>CatalogRef.итСкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеЗадачи</name>
      <type>
        <types>EnumRef.итWMSСостоянияЗадачТСД</types>
      </type>
    </attributes>
    <attributes>
      <name>КарантинПаллеты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

WMSGIFT/src/Documents/итWMSДанныеИнвентаризации/Forms/ФормаДанныхSSCCПриРазмещении/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не Параметры.Свойство("ИдентификаторУпаковки") Тогда 
		Отказ=Истина;
		Сообщить("нет идентификатора упаковки");
		Возврат
	КонецЕсли;
	ЗаполнитьДаннымиПоИдентификаторУпаковки(Параметры.ИдентификаторУпаковки);
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьДаннымиПоИдентификаторУпаковки(ИдентификаторУпаковки)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	итWMSРазмещениеТовары.Ссылка.Номер КАК НомерРазмещения,
		|	итWMSРазмещениеТовары.Ссылка.Дата,
		|	итWMSРазмещениеТовары.ИдентификаторУпаковки,
		|	итWMSРазмещениеТовары.Номенклатура,
		|	итWMSРазмещениеТовары.СерияНоменклатуры,
		|	итWMSРазмещениеТовары.Качество,
		|	итWMSРазмещениеТовары.Количество,
		|	итWMSРазмещениеТовары.ЯчейкаПолучатель,
		|	итWMSРазмещениеТовары.КарантинПаллеты,
		|	итWMSРазмещениеТовары.Склад,
		|	итWMSРазмещениеТовары.Комментарий
		|ИЗ
		|	Документ.итWMSРазмещение.Товары КАК итWMSРазмещениеТовары
		|ГДЕ
		|	итWMSРазмещениеТовары.Ссылка.Проведен = ИСТИНА
		|	И итWMSРазмещениеТовары.ИдентификаторУпаковки = &ИдентификаторУпаковки
		|
		|СГРУППИРОВАТЬ ПО
		|	итWMSРазмещениеТовары.Ссылка.Номер,
		|	итWMSРазмещениеТовары.Ссылка.Дата,
		|	итWMSРазмещениеТовары.ИдентификаторУпаковки,
		|	итWMSРазмещениеТовары.Номенклатура,
		|	итWMSРазмещениеТовары.СерияНоменклатуры,
		|	итWMSРазмещениеТовары.Качество,
		|	итWMSРазмещениеТовары.Количество,
		|	итWMSРазмещениеТовары.ЯчейкаПолучатель,
		|	итWMSРазмещениеТовары.КарантинПаллеты,
		|	итWMSРазмещениеТовары.Склад,
		|	итWMSРазмещениеТовары.Комментарий";
	
	Запрос.УстановитьПараметр("ИдентификаторУпаковки", ИдентификаторУпаковки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ТаблицаДанных.Очистить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	НоваяСтрока=ТаблицаДанных.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры
